controllers/DailyWeightController.php

    protected function findModel($id)
    {
        if (($model = DailyWeight::findOne($id)) !== null) {
---
SELECT * FROM `daily_weight` WHERE `id`='3'